In [18]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [51]:
salary=pd.read_csv("E:\\itsstudytym\\assignments\\SVM\\SalaryData_Train.csv")
salary.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [52]:
for i in range(0, len(salary['Salary'])):
    if salary['Salary'][i]==' <=50K':
        salary['Salary'][i]=0
    else:
        salary['Salary'][i]=1

C:\Users\sonih\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\sonih\anaconda3\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [53]:
salary=salary.drop(['educationno','maritalstatus','relationship','race','sex','native'],axis=1)
salary.head()

,age,workclass,education,occupation,capitalgain,capitalloss,hoursperweek,Salary
0,39,State-gov,Bachelors,Adm-clerical,2174,0,40,0
1,50,Self-emp-not-inc,Bachelors,Exec-managerial,0,0,13,0
2,38,Private,HS-grad,Handlers-cleaners,0,0,40,0
3,53,Private,11th,Handlers-cleaners,0,0,40,0
4,28,Private,Bachelors,Prof-specialty,0,0,40,0

In [43]:
for i in salary.columns:
    if salary[i].dtypes == 'O':
        print(i,"has",len(salary[i].unique()),"unique")

workclass has 7 unique
education has 16 unique
occupation has 14 unique
Salary has 2 unique

In [54]:
salary['Salary']=salary['Salary'].astype(int)

In [45]:
workclass={
    ' State-gov':1,
    ' Federal-gov':2,
    ' Local-gov':3,
    ' Private':4,
    ' Self-emp-inc':5,
    ' Self-emp-not-inc':6,
    ' Without-pay':7
}

education={
    ' Doctorate':1,
    ' Prof-school':2,
    ' Masters':3,
    ' Bachelors':4,
    ' Some-college':5,
    ' HS-grad':6,
    ' Assoc-acdm':7,
    ' Assoc-voc':8,
    ' 12th':9,
    ' 11th':10,
    ' 10th':11,
    ' 9th':12,
    ' 7th-8th':13,
    ' 5th-6th':14,
    ' 1st-4th':15,
    ' Preschool':16
}

In [55]:
salary['workclass']=salary['workclass'].map(workclass)
salary['education']=salary['education'].map(education)

In [47]:
salary.head()

,age,workclass,education,occupation,capitalgain,capitalloss,hoursperweek,Salary
0,39,1,4,Adm-clerical,2174,0,40,0
1,50,6,4,Exec-managerial,0,0,13,0
2,38,4,6,Handlers-cleaners,0,0,40,0
3,53,4,10,Handlers-cleaners,0,0,40,0
4,28,4,4,Prof-specialty,0,0,40,0

In [56]:
Occupation=pd.get_dummies(salary['occupation'],drop_first=True)
salary=salary.drop('occupation',axis=1)

In [49]:
salary.head()

   age  workclass  education  capitalgain  capitalloss  hoursperweek  Salary
0   39          1          4         2174            0            40       0
1   50          6          4            0            0            13       0
2   38          4          6            0            0            40       0
3   53          4         10            0            0            40       0
4   28          4          4            0            0            40       0

In [57]:
salary=pd.concat([salary,Occupation],axis=1)
salary.head()

,age,workclass,education,capitalgain,capitalloss,hoursperweek,Salary,Armed-Forces,Craft-repair,Exec-managerial,Farming-fishing,Handlers-cleaners,Machine-op-inspct,Other-service,Priv-house-serv,Prof-specialty,Protective-serv,Sales,Tech-support,Transport-moving
0,39,1,4,2174,0,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0
1,50,6,4,0,0,13,0,0,0,1,0,0,0,0,0,0,0,0,0,0
2,38,4,6,0,0,40,0,0,0,0,0,1,0,0,0,0,0,0,0,0
3,53,4,10,0,0,40,0,0,0,0,0,1,0,0,0,0,0,0,0,0
4,28,4,4,0,0,40,0,0,0,0,0,0,0,0,0,1,0,0,0,0

In [58]:
salary.dtypes

age                   int64
workclass             int64
education             int64
capitalgain           int64
capitalloss           int64
hoursperweek          int64
Salary                int32
 Armed-Forces         uint8
 Craft-repair         uint8
 Exec-managerial      uint8
 Farming-fishing      uint8
 Handlers-cleaners    uint8
 Machine-op-inspct    uint8
 Other-service        uint8
 Priv-house-serv      uint8
 Prof-specialty       uint8
 Protective-serv      uint8
 Sales                uint8
 Tech-support         uint8
 Transport-moving     uint8
dtype: object

In [60]:
X=salary.drop('Salary',axis=1)
y=salary['Salary']

In [61]:
from sklearn.model_selection import train_test_split

In [95]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=10)

In [65]:
from sklearn.svm import SVC

In [68]:
m1=SVC()

In [96]:
m1.fit(X_train,y_train)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [97]:
pred=m1.predict(X_test)

In [78]:
from sklearn.metrics import classification_report, confusion_matrix, accuracy_score

In [85]:
classification_report(y_test, pred)

'              precision    recall  f1-score   support\n\n           0       0.80      0.97      0.88      4543\n           1       0.73      0.26      0.38      1490\n\n    accuracy                           0.79      6033\n   macro avg       0.76      0.61      0.63      6033\nweighted avg       0.78      0.79      0.75      6033\n'

In [86]:
confusion_matrix(y_test, pred)

array([[4396,  147],
       [1101,  389]], dtype=int64)

In [98]:
accuracy_score(y_test,pred)

0.8022542681916128

## Regularization

In [99]:
m_C = SVC(C=10)

In [102]:
m_C.fit(X_train, y_train)

SVC(C=10, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [103]:
m_C.score(X_test,y_test)

0.8092159787833582

## Gamma

In [104]:
m_g=SVC(gamma=12)

In [105]:
m_g.fit(X_train,y_train)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma=12, kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [106]:
m_g.score(X_test,y_test)

0.7520304989225924

## Regularization And Gamma

In [110]:
m=SVC(C=10, gamma=5)

In [111]:
m.fit(X_train, y_train)

SVC(C=10, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma=5, kernel='rbf', max_iter=-1,
    probability=False, random_state=None, shrinking=True, tol=0.001,
    verbose=False)

In [112]:
m.score(X_test, y_test)

0.7520304989225924

## Test Data

In [125]:
test=pd.read_csv("E:\\itsstudytym\\assignments\\SVM\\SalaryData_Test.csv")
test.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,25,Private,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,34,Private,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K

In [126]:
test=test.drop(['educationno','maritalstatus','relationship','race','sex','native'],axis=1)

In [127]:
for i in range(0, len(test['Salary'])):
    if test['Salary'][i]==" <=50K":
        test['Salary'][i]=0
    else:
        test['Salary'][i]=1

C:\Users\sonih\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\sonih\anaconda3\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [128]:
test['workclass']=test['workclass'].map(workclass)
test['education']=test['education'].map(education)

In [129]:
Occupation=pd.get_dummies(test['occupation'],drop_first=True)

In [130]:
test=test.drop('occupation',axis=1)

In [131]:
test=pd.concat([test, Occupation],axis=1)
test.head()

,age,workclass,education,capitalgain,capitalloss,hoursperweek,Salary,Armed-Forces,Craft-repair,Exec-managerial,Farming-fishing,Handlers-cleaners,Machine-op-inspct,Other-service,Priv-house-serv,Prof-specialty,Protective-serv,Sales,Tech-support,Transport-moving
0,25,4,10,0,0,40,0,0,0,0,0,0,1,0,0,0,0,0,0,0
1,38,4,6,0,0,50,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,28,3,7,0,0,40,1,0,0,0,0,0,0,0,0,0,1,0,0,0
3,44,4,5,7688,0,40,1,0,0,0,0,0,1,0,0,0,0,0,0,0
4,34,4,11,0,0,30,0,0,0,0,0,0,0,1,0,0,0,0,0,0

In [132]:
test_x=test.drop('Salary',axis=1)

In [138]:
test['Salary']=test['Salary'].astype(int)

In [142]:
test_x.head()

,age,workclass,education,capitalgain,capitalloss,hoursperweek,Armed-Forces,Craft-repair,Exec-managerial,Farming-fishing,Handlers-cleaners,Machine-op-inspct,Other-service,Priv-house-serv,Prof-specialty,Protective-serv,Sales,Tech-support,Transport-moving
0,25,4,10,0,0,40,0,0,0,0,0,1,0,0,0,0,0,0,0
1,38,4,6,0,0,50,0,0,0,1,0,0,0,0,0,0,0,0,0
2,28,3,7,0,0,40,0,0,0,0,0,0,0,0,0,1,0,0,0
3,44,4,5,7688,0,40,0,0,0,0,0,1,0,0,0,0,0,0,0
4,34,4,11,0,0,30,0,0,0,0,0,0,1,0,0,0,0,0,0

In [135]:
pred=m_C.predict(test_x)

In [139]:
confusion_matrix(test['Salary'],pred)

array([[11189,   171],
       [ 2749,   951]], dtype=int64)

In [141]:
accuracy_score(test['Salary'],pred)

0.8061088977423638